InformationRegisters/ЛБ_СостояниеЗалоговогоБилета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_СостояниеЗалоговогоБилета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ПричиныПримененияПроцентнойСхемы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЗалоговогоБилета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыЗалоговыхБилетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЗайма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаРасчетаПроцентов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДопСоглашения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыкупаЛьготныйСрок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПроцентовСрок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗайма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредельныйСрокЗаймаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОстановкиНачислений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыБезПродления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Залогодатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СхемаКредитования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_СхемыКредитования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_РасчетыСКлиентамиПоОбъектамЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ОбъектыЗалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ОбъектыЗалога</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОбъектыЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДокументыЗалогодателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДокументыЗалогодателей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДУЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойДоп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДатаВыдачи</Name>
					<Comment>Дата выдачи документа</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКемВыдан</Name>
					<Comment>Кем выдан </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументКодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСерия</Name>
					<Comment>Серия документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНомер</Name>
					<Comment>Номер документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНеДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмерти</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументСтранаЭмитент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументНаименованиеИногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ПричиныИзмененияКарточкиЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДокументыЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокументаЗалогодателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДокументовЗалогодателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтменыОперацийЗБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтменыОперацийЗБ</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерЗалоговогоБилета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОтмененныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОперацияПоЗалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОперацияПоЗалогу</Name>
			<Comment>Виды операций документа "Операция по залогу"</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залог</Name>
					<Comment>Выдача займа под залог</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзъятиеОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОбъектовЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаПереоформления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстановкаПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиСОХ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаИзъятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВозвратаИзъятого</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаОстановкиНачисленияПроцентов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/ЛБ_ВозвратОбъектовЗалога/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если НЕ ТекПользователь.ЭтоЛомбард Тогда
   		Если УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
			СотрудникЦО = Истина;
		КонецЕсли;
	КонецЕсли;	

	Если Параметры.Свойство("Документ") Тогда
        ДокументВозврата = Параметры.Документ; 
		Если ДокументВозврата.Проведен тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		Иначе
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		КонецЕсли;		
		ДатаДок = ДокументВозврата.Дата; 
		Ломбард = ДокументВозврата.Ломбард;
		ОтветственныйПользователь = ДокументВозврата.ОтветственныйПользователь; 
		ОтветственныйСотрудник = ДокументВозврата.ОтветственныйСотрудник; 
		Комментарий = ДокументВозврата.Комментарий;
		ЗалоговыйБилет = ДокументВозврата.ПредыдущаяОперация;    
		ДокументВозвратаНаименование = ДокументВозврата.ДокументВозвратаНаименование;
		ДокументВозвратаДата = ДокументВозврата.ДокументВозвратаДата;
		ДокументВозвратаНомер = ДокументВозврата.ДокументВозвратаНомер;
		ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(ДокументВозврата, ЗалоговыйБилет);
		ЗаполнитьТовары();  
		ЗаполнитьСостояниеЗалоговогоБилета();
		//+Мельников 25.04.24 Отмена операции.
		ДокументОтмены = ПолучитьДокументОтмены(ДокументВозврата); //Было: ДокументВозврата.ДокументОтмены;
		//-Мельников          
		Если Параметры.ТолькоПросмотр = Истина Тогда	
			Этаформа.ТолькоПросмотр = Истина;
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ЗалоговыйБилет") Тогда
		ЗалоговыйБилет = Параметры.ЗалоговыйБилет;
		СтатусЗБ = ЛБ_УправлениеЛомбардом.ПолучитьСтатусЗалоговогоБилета(ТекущаяДата(), ЗалоговыйБилет);
		//Если СтатусЗБ = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Изъят Тогда 
		    Если Параметры.Свойство("Ломбард") Тогда 
				Ломбард = Параметры.Ломбард;
			Иначе	
			    Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя(); 
			КонецЕсли;	
			ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
			//Если НЕ ТекПользователь.ЭтоЛомбард Тогда
			//  	ОтветственныйПользователь = ТекПользователь;
			//Иначе
			//	ОтветственныйПользователь = ПараметрыСеанса.ТекущийСотрудник;
			//КонецЕсли;
			ОтветственныйПользователь = ПараметрыСеанса.ТекущийПользователь; 
			ОтветственныйСотрудник = ПараметрыСеанса.ТекущийСотрудник; 

			ДатаДок = ТекущаяДатаСеанса(); 
			ПричинаПримененияПроцентнойСхемы = ЛБ_УправлениеЛомбардом.ПолучитьПричинуПримененияПроцентнойСхемы(, ЗалоговыйБилет);
			ЗаполнитьТовары();  
			ЗаполнитьСостояниеЗалоговогоБилета(); 
		//Иначе 
		//	Сообщить("Статус выбранного залогового билета " + ?(СтатусЗБ = неопределено, "не определен", строка(СтатусЗБ)) + ". Возврат залога невозможен!"); 
		//    Отказ = Истина;
		//КонецЕсли;	
	Иначе 
		Сообщить("Не выбран залоговый билет!"); 
		Отказ = Истина;
	КонецЕсли;
	//+Мельников 25.04.24 Отена операции.
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НеРедактировать Тогда  
		Элементы.Редактировать.Видимость = ?(Этаформа.ТолькоПросмотр, Ложь, Истина);  
		Элементы.Вернуть.Доступность = ложь;
		Элементы.Отмена.Заголовок = "Закрыть";
	КонецЕсли;
	Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЭтаФорма.ТолькоПросмотр = НеРедактировать;  
	Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
	Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
	Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
	Элементы.Редактировать.Видимость = Ложь;  
	Элементы.Вернуть.Доступность = Истина;
	Элементы.Отмена.Заголовок = "Отмена";
КонецПроцедуры

&НаСервере
Функция СоздатьНовыйВозврат()
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет; 
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога;
	ДокументОбъект.Дата = ?(ЗначениеЗаполнено(ДокументВозврата), ДатаДок-1, ДатаДок);
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	Возврат ДокументОбъект; 
КонецФункции

&НаСервере
Процедура ЗаполнитьСостояниеЗалоговогоБилета()
	ТаблицаСостояний.Очистить();
	
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ДокументВозврата) Тогда
		Запрос.УстановитьПараметр("Период", ДатаДок-1); 
	Иначе	
	    Запрос.УстановитьПараметр("Период", ДатаДок); 
	КонецЕсли;	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_СостояниеЗалоговогоБилета.Регистратор КАК Регистратор,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаЗайма КАК СуммаЗайма,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупа КАК ДатаВыкупа,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаВыкупаЛьготныйСрок КАК ДатаВыкупаЛьготныйСрок,
	               |	ЛБ_СостояниеЗалоговогоБилета.СтатусЗалоговогоБилета КАК СтатусЗалоговогоБилета,
	               |	ЛБ_СостояниеЗалоговогоБилета.ДатаНачалаРасчетаПроцентов КАК ДатаНачалаРасчетаПроцентов,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовДень КАК СуммаПроцентовДень,
	               |	ЛБ_СостояниеЗалоговогоБилета.СуммаПроцентовСрок КАК СуммаПроцентовСрок
	               |ИЗ
	               |	РегистрСведений.ЛБ_СостояниеЗалоговогоБилета КАК ЛБ_СостояниеЗалоговогоБилета
	               |ГДЕ
	               |	ЛБ_СостояниеЗалоговогоБилета.ЗалоговыйБилет = &ЗалоговыйБилет
	               |	И ЛБ_СостояниеЗалоговогоБилета.Период <= &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЛБ_СостояниеЗалоговогоБилета.Период";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	Если ТаблицаЗапроса.Количество() > 0 Тогда
		СтрСостояние = ТаблицаЗапроса.Получить(0);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Начальные условия займа";
		НоваяСтр.КлючСтроки = 1;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета;
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.ДатаНачалаРасчета = СтрСостояние.ДатаНачалаРасчетаПроцентов;
		НоваяСтр.ПроцентнаяСтавка = ЗалоговыйБилет.ПроцентнаяСхема;
		НоваяСтр.СуммаПроцентовДень = СтрСостояние.СуммаПроцентовДень;
		НоваяСтр.СуммаПроцентовСрок = СтрСостояние.СуммаПроцентовСрок;
		
		КолСтр = ТаблицаЗапроса.Количество()-1;
		СтрСостояние = ТаблицаЗапроса.Получить(КолСтр);
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета до возврата";
		НоваяСтр.КлючСтроки = 2;
		НоваяСтр.Статус = СтрСостояние.СтатусЗалоговогоБилета; 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		Если ЗначениеЗаполнено(ДокументВозврата) тогда   
			ДокументОбъект = ДокументВозврата.ПолучитьОбъект();
		Иначе	
			ДокументОбъект = СоздатьНовыйВозврат();			
		КонецЕсли; 
		СуммаПроцентовДолг = ЛБ_ОбщийМодуль.ПолучитьОстатокПроцентов(ДокументОбъект, ДокументОбъект.ПредыдущаяОперация);
		НоваяСтр.СуммаПроцентовДолг = СуммаПроцентовДолг; 
		
		НоваяСтр = ТаблицаСостояний.Добавить();
		НоваяСтр.Состояние = "Состояние залогового билета после возврата";
		НоваяСтр.КлючСтроки = 3; 
		НоваяСтр.Статус = Перечисления.ЛБ_СтатусыЗалоговыхБилетов.Возвращен; 
		НоваяСтр.СуммаЗайма = СтрСостояние.СуммаЗайма;
		НоваяСтр.ДатаВозврата = СтрСостояние.ДатаВыкупа;
		НоваяСтр.ДатаВозвратаЛьготная = СтрСостояние.ДатаВыкупаЛьготныйСрок; 
		НоваяСтр.СуммаПроцентовДолг = СуммаПроцентовДолг;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТовары()
	ТаблицаТоваров.Очистить();
	
	Запрос = новый Запрос;   
	Запрос.УстановитьПараметр("ЗалоговыйБилет", ЗалоговыйБилет); 
	Если ЗначениеЗаполнено(ДокументВозврата) И ДокументВозврата.Проведен Тогда 
		ДатаПроверки = ДатаДок-1; 
	Иначе	 
		ДатаПроверки = ДатаДок;
	КонецЕсли;	     
	Запрос.УстановитьПараметр("Дата", ДатаПроверки);

	//+Мельников 25.04.24 Отмена операции. Убрал старый запрос т.к. он не учитывал суммы по отмененным операциям.
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	               |	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	               |ИЗ
	               |	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	               |ГДЕ
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога";
	//Запрос.Текст = "ВЫБРАТЬ
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога КАК ОбъектЗалога,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаОборот КАК СуммаОборот,
	//				|	СУММА(ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход) КАК СуммаОплаты
	//				|ИЗ
	//				|	РегистрНакопления.ЛБ_РасчетыСКлиентамиПоОбъектамЗалога.Обороты(, &Дата, , ) КАК ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты
	//				|ГДЕ
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ЗалоговыйБилет = &ЗалоговыйБилет
	//				|
	//				|СГРУППИРОВАТЬ ПО
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.ОбъектЗалога,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаОборот,
	//				|	ЛБ_РасчетыСКлиентамиПоОбъектамЗалогаОбороты.СуммаРасход";
	//-Мельников
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();  
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога КАК ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард КАК Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад КАК Склад,
	               |	СУММА(ЛБ_ОбъектыЗалогаОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	РегистрНакопления.ЛБ_ОбъектыЗалога.Остатки(&Дата, ЗалоговыйБилет = &ЗалоговыйБилет) КАК ЛБ_ОбъектыЗалогаОстатки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЛБ_ОбъектыЗалогаОстатки.ОбъектЗалога,
	               |	ЛБ_ОбъектыЗалогаОстатки.Ломбард,
	               |	ЛБ_ОбъектыЗалогаОстатки.Склад";
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	Ном = 0;
	Для каждого стр Из ЗалоговыйБилет.Товары цикл
		Если ЗалоговыйБилет.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.Переоформление Тогда 
			Если НЕ Стр.Переоформить тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли;	      
		Ном = Ном + 1;
		Статус = ЛБ_УправлениеЛомбардом.ПолучитьСостояниеОбъектаЗалога(ДатаПроверки, Стр.ОбъектЗалога, ЗалоговыйБилет);		
		НоваяСтр = ТаблицаТоваров.Добавить(); 
		НоваяСтр.Номерстроки = Стр.Номерстроки;   
		НоваяСтр.Артикул = ЛБ_УправлениеЛомбардом.АртикулОбъектаЗалога(ЗалоговыйБилет, Ном);
		НоваяСтр.ОбъектЗалога = стр.ОбъектЗалога; 
		НоваяСтр.СтатусОбъектаЗалога = Статус;        
	    НоваяСтр.СуммаОценки = стр.СуммаОценкиМаксимальная;
		НоваяСтр.СуммаОценкиЗайм = стр.СуммаСсуды;  
		Отбор = Новый структура;
		Отбор.Вставить("ОбъектЗалога", НоваяСтр.ОбъектЗалога);
		Строки = ТаблицаЗапроса.НайтиСтроки(Отбор);
		Если НЕ строки.Количество() = 0 тогда			
			//+Мельников 25.04.24 Отмена операции. Изменил.
			НоваяСтр.СуммаОплаты = Строки.Получить(0).СуммаОплаты;
			//НоваяСтр.СуммаОплаты = НоваяСтр.СуммаОценки - Строки.Получить(0).СуммаОборот;
			//-Мельников
		КонецЕсли;	 
		НоваяСтр.Задолженность = НоваяСтр.СуммаОценкиЗайм - НоваяСтр.СуммаОплаты; 
		
		Если НЕ Статус = Перечисления.ЛБ_СтатусыОбъектовЗалога.Изъят Тогда 
			НоваяСтр.СтатусОбъектаЗалогаПослеВозврата = НоваяСтр.СтатусОбъектаЗалога;   
			Отбор.Вставить("Ломбард", Ломбард);
		    Отбор.Вставить("ОбъектЗалога", Стр.ОбъектЗалога);
		    Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 тогда   
				СтрОст = Строки.Получить(0);
				НоваяСтр.Склад = СтрОст.Склад; 
			Иначе
				Отбор.Удалить("Ломбард");
				Строки = ТаблицаОстатков.НайтиСтроки(Отбор);
				Если НЕ Строки.Количество() = 0 тогда   
					СтрОст = Строки.Получить(0);
					НоваяСтр.Склад = СтрОст.Склад; 
	            КонецЕсли;
			КонецЕсли;	

			Продолжить; 
		Иначе     
			Если НЕ Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
			    НоваяСтр.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Ломбард, Перечисления.ЛБ_ВидыСкладов.Залоги);	 
			Иначе
				НоваяСтр.Склад = ЛБ_ОбщийМодуль.ПолучитьСклад(Ломбард, Перечисления.ЛБ_ВидыСкладов.ОбщийСкладЦО);
			КонецЕсли;	
		КонецЕсли;	
		Если ЗначениеЗаполнено(ДокументВозврата) тогда 
			//поставим галочку вернуть  
			Строки = ДокументВозврата.ТоварыИзъятыеВозвращенные.НайтиСтроки(Отбор);
			Если НЕ Строки.Количество() = 0 тогда    
				НоваяСтр.Вернуть = Истина;
				НоваяСтр.СтатусОбъектаЗалогаПослеВозврата = Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен;
			Иначе	 
				НоваяСтр.СтатусОбъектаЗалогаПослеВозврата = НоваяСтр.СтатусОбъектаЗалога;
			КонецЕсли;
		Иначе
			НоваяСтр.Вернуть = Истина;
			НоваяСтр.СтатусОбъектаЗалогаПослеВозврата = Перечисления.ЛБ_СтатусыОбъектовЗалога.Возвращен;
		КонецЕсли;	
	Конеццикла;	
	
	ТоварыИтогОценка = ТаблицаТоваров.Итог("СуммаОценки");
	ТоварыИтогОценкаЗайм = ТаблицаТоваров.Итог("СуммаОценкиЗайм");
	ТоварыИтогОплата = ТаблицаТоваров.Итог("СуммаОплаты");
	ТоварыИтогДолг = ТаблицаТоваров.Итог("Задолженность");
КонецПроцедуры	

&НаКлиенте
Процедура ИсторияЗБ(Команда)
	Если ЗначениеЗаполнено(ЗалоговыйБилет) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
		ПараметрыФормы.Вставить("ЗалоговыйБилет", ЗалоговыйБилет);	 
								
		ОткрытьФорму("Отчет.ЛБ_ИсторияЗалоговогоБилета.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция СнятьСПроведения(Документ)  
	ДокОбъект = Документ.ПолучитьОбъект(); 
	Если ДокОбъект.Проведен Тогда  
		ЗапросП = Новый Запрос;  
		ЗапросП.УстановитьПараметр("ЗБ", ЗалоговыйБилет); 
		ЗапросП.УстановитьПараметр("Ссылка", Документ);  
		ЗапросП.УстановитьПараметр("Дата", ДатаДок);
		ЗапросП.Текст = "ВЫБРАТЬ
		                |	ЛБ_ОперацияПоЗалогу.Ссылка КАК Ссылка
		                |ИЗ
		                |	Документ.ЛБ_ОперацияПоЗалогу КАК ЛБ_ОперацияПоЗалогу
		                |ГДЕ
		                |	ЛБ_ОперацияПоЗалогу.ПредыдущаяОперация = &ЗБ
		                |	И ЛБ_ОперацияПоЗалогу.Проведен = ИСТИНА
		                |	И ЛБ_ОперацияПоЗалогу.Дата >= &Дата
		                |	И НЕ ЛБ_ОперацияПоЗалогу.Ссылка = &Ссылка";
		ВыборкаП = ЗапросП.Выполнить().Выбрать();
		Если ВыборкаП.Следующий() тогда 
			Сообщить("По залоговому билету " + СокрЛП(Документ.НомерЗалоговогоБилета) + " есть проведенные документы с более поздней датой. Редактирование запрещено.");
			Возврат Ложь;
		КонецЕсли;                                          
		Попытка
		    ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);  
			Возврат Истина;
		Исключение   
			Сообщить("Не удалось снять с проведения документ возврата объектов залога. Редактирование запрещено.");
			Возврат Ложь;
		КонецПопытки;	
	Иначе
		возврат Истина;
	КонецЕсли;
КонецФункции	


&НаКлиенте
Процедура Редактировать(Команда)
	ПроверкаМожноРедактировать = Истина;
	Если ЭтаФорма.НеРедактировать Тогда 
		Результат = СнятьСПроведения(ДокументВозврата);
		Если НЕ Результат тогда  
			ПроверкаМожноРедактировать = Ложь;
		КонецЕсли;	
		Если ПроверкаМожноРедактировать Тогда  
			НеРедактировать = Ложь;
			Элементы.ОсновнаяПанель.ТолькоПросмотр = Ложь;
			Этаформа.Открыть();
		КонецЕсли;	
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции.
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для каждого стр из ТаблицаТоваров цикл
		Если НЕ стр.СтатусОбъектаЗалога = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят") Тогда
			Продолжить;
		КонецЕсли;	
		Стр.вернуть = Истина; 		 
		стр.СтатусОбъектаЗалогаПослевозврата = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен");
	Конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	Для каждого стр из ТаблицаТоваров цикл
		Если НЕ стр.СтатусОбъектаЗалога = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Изъят") Тогда
			Продолжить;
		КонецЕсли;	
		Стр.вернуть = Ложь;  
		Стр.СтатусОбъектаЗалогаПослеВозврата = Стр.СтатусОбъектаЗалога;
	Конеццикла;	
КонецПроцедуры    

&НаСервере
Функция СоздатьДокументНаСервере()  
	Если ЗначениеЗаполнено(ДокументВозврата) Тогда
		ДокументОбъект = ДокументВозврата.ПолучитьОбъект();
		ДокументОбъект.Дата = ДатаДок;
	Иначе	         		
	    ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
		ДокументОбъект.Дата = ДатаДок;
		ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ВозвратОбъектовЗалога;  
	    ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
        ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
      	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель); 
		ДокументОбъект.Залогодатель = ЗалоговыйБилет.Залогодатель;  
		ДокументОбъект.ДокументЗалогодателя = ЗалоговыйБилет.ДокументЗалогодателя;
		ДокументОбъект.СхемаКредитования = ЗалоговыйБилет.СхемаКредитования;  
		ДокументОбъект.СрокЗалога = ЗалоговыйБилет.СрокЗалога; 
		ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
		ДокументОбъект.НомерЗалоговогоБилета = ЗалоговыйБилет.НомерЗалоговогоБилета;
	КонецЕсли;	
	ДокументОбъект.Ломбард = Ломбард; 
	//ДокументОбъект.Ответственный = ОтветственныйПользователь;
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь; 
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник; 

	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.ДокументВозвратаНаименование = ДокументВозвратаНаименование;  
	ДокументОбъект.ДокументВозвратаНомер = ДокументВозвратаНомер;
	ДокументОбъект.ДокументВозвратаДата = ДокументВозвратаДата;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
        ДокументОбъект.Имя = Выборка.Имя;
        ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;
	
	ДокументОбъект.ТоварыИзъятыеВозвращенные.Очистить();
	Для каждого стр из ТаблицаТоваров Цикл 
		Если НЕ стр.Вернуть Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ДокументОбъект.ТоварыИзъятыеВозвращенные.Добавить();
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;  
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	Конеццикла;	
	
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0);
	ДокументОбъект.ДатаВыкупа = СтрНач.ДатаВозврата;
    ДокументОбъект.ДатаВыкупаЛьготная = СтрНач.ДатаВозвратаЛьготная;	
	ДокументОбъект.СуммаСсуды = СтрНач.СуммаЗайма;  
			    	 	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           
	    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
		ДокументВозврата = ДокументОбъект.Ссылка;
		Возврат ложь;
	Исключение   
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
		Возврат Истина;
	КонецПопытки;  
КонецФункции	
	
&НаСервере
Функция ПроверкаДокумента()
	ВсеОК = ПроверитьЗаполнение();
	
	ЕстьВозврат = ложь;
	Для каждого стр из ТаблицаТоваров Цикл 
		Если стр.Вернуть Тогда
			ЕстьВозврат = Истина;
			Прервать;
		КонецЕсли;	
	Конеццикла;	
	Если НЕ ЕстьВозврат тогда
		Сообщить("Не выбраны возвращаемые объекты залога!");
		ВсеОК = Ложь;
	КонецЕсли;	
	Возврат ВсеОК;
КонецФункции	

&НаКлиенте
Процедура Вернуть(Команда)
	Если НеРедактировать тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверкаДокумента() Тогда
		ЕстьНеПроведенные  = СоздатьДокументНаСервере();
		Если НЕ ЕстьНеПроведенные Тогда
			НеРедактировать = Истина;
			Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
			Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
			Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
	        Элементы.Редактировать.Видимость = Истина; 
			Элементы.Вернуть.Доступность = Ложь;
		    Элементы.Отмена.Заголовок = "Закрыть"; 
			Элементы.ОсновнаяПанель.ТолькоПросмотр = НеРедактировать;  
			Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
	   	        ФормаРМП = ВладелецФормы;   
				Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
	                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
				КонецЕсли;	
            КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	//+Мельников 25.04.24 Отмена операции.
	УстановитьВидимость();
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументВозврата), ДокументВозврата, неопределено));
КонецПроцедуры

&НаКлиенте
Процедура ДатаДокПриИзменении(Элемент)
	ЗаполнитьТовары();  
	ЗаполнитьСостояниеЗалоговогоБилета();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаТоваровВернутьПриИзменении(Элемент)
	ТекСтрока = Элементы.ТаблицаТоваров.ТекущиеДанные;
	Если ТекСтрока.Вернуть тогда  
		ТекСтрока.СтатусОбъектаЗалогаПослеВозврата = ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыОбъектовЗалога.Возвращен");
	Иначе    
		ТекСтрока.СтатусОбъектаЗалогаПослеВозврата = ТекСтрока.СтатусОбъектаЗалога;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Вперед(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОсновная тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно; 
	КонецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаДополнительно тогда 
		Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.СтраницаОсновная; 
	конецЕсли;	  
	ПриСменеСтраницы(Элементы.ОсновнаяПанель.ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеСтраницы(ТекущаяСтраница)
    Если ТекущаяСтраница = Элементы.СтраницаОсновная Тогда 
		Элементы.Вперед.Доступность = Истина; 
		Элементы.Назад.Доступность = Ложь;
	ИначеЕсли ТекущаяСтраница = Элементы.СтраницаДополнительно Тогда 
		Элементы.Вперед.Доступность = Ложь; 
		Элементы.Назад.Доступность = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПриСменеСтраницы(ТекущаяСтраница);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЭтаФорма.Закрыть(?(ЗначениеЗаполнено(ДокументВозврата), ДокументВозврата, неопределено));
КонецПроцедуры

&НаСервере
Функция ПолучитьЗалогодателя()
	Возврат  ЗалоговыйБилет.Залогодатель;
КонецФункции

&НаКлиенте
Процедура СтатистикаПоКлиенту(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("Дата", ДатаДок);	 
							
	ОткрытьФорму("Отчет.ЛБ_СтатистикаОбращенийКлиента.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Расчеты(Команда)
	ПараметрыФормы = Новый Структура;  
	ПараметрыФормы.Вставить("Клиент", ПолучитьЗалогодателя());
	ПараметрыФормы.Вставить("ЗалоговыйБилет", ЭтаФорма.ЗалоговыйБилет);	
	ПараметрыФормы.Вставить("Дата", ЭтаФорма.ДатаДок);
							
	ОткрытьФорму("Отчет.ЛБ_НачисленныеПроцентыПоДоговоруЗайма.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаТоваровПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

//+Мельников 25.04.24 Отмена операции
&НаКлиенте
Процедура ОтменитьОперацию(Команда)
	
	ПоследняяОперация = ПолучитьИнформациюОЗБ(ЗалоговыйБилет, ТекущаяДата());
	ЛомбардПользователя = ПолучитьЛомбардПольвателя();
	ЛомбардВДокументе = ПолучитьЛомбардВдокументе(ПоследняяОперация.ДокументОперации);
	
	Если ЛомбардВДокументе = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") И СотрудникЦО Тогда 
		Если Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") <> Формат(ПоследняяОперация.Дата, "ДФ=dd.MM.yyyy") Тогда
			Предупреждение("Отмена операции возможна только в текущем дне.");
			Возврат;
        КонецЕсли;
	Иначе	
		Если ЛомбардПользователя <> ЛомбардВДокументе Тогда
			Предупреждение("Операция оформлена в другом ломбарде.
			|Действия с документом запрещены!");
			Возврат
		ИначеЕсли Формат(ТекущаяДата(), "ДФ=dd.MM.yyyy") <> Формат(ПоследняяОперация.Дата, "ДФ=dd.MM.yyyy") Тогда
			Предупреждение("Отмена операции возможна только в текущем дне.");
			Возврат
		ИначеЕсли ТекущаяДата() - ДатаДок >= 3600 Тогда
			Предупреждение("Прошло больше часа от времени оформления текущей операции.");
			Возврат
		КонецЕсли;	
	КонецЕсли;
	
	Ответ = Вопрос("Выполнить отмену текущей операции?", РежимДиалогаВопрос.ДаНет);
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ДокументПроведен = ОтменитьОперациюНаСервере();
		УстановитьВидимость();
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ДокументПроведен Тогда
		Сообщить("Документ отмены создан");  
		Если ВладелецФормы.ИмяФормы = "ОбщаяФорма.ЛБ_РабочееМестоПриемщикаЛомбарда" Тогда
   	        ФормаРМП = ВладелецФормы;   
			Если ФормаРМП.Залогодатель = ПолучитьЗалогодателя() Тогда
                ФормаРМП.ПослеВыбораТекущееСостояниеЗБ(Истина, неопределено); 
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтменитьОперациюНаСервере()
	
	ДокументОбъект = Документы.ЛБ_ОперацияПоЗалогу.СоздатьДокумент(); 
	ДокументОбъект.Дата = ТекущаяДата();
	ДокументОбъект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВозвратаИзъятого;  
	ДокументОбъект.ПредыдущаяОперация = ЗалоговыйБилет;
	ДокументОбъект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить(); 
	ДокументОбъект.СтатусЗалогодателя = ЛБ_УправлениеЛомбардом.ПолучитьТекущийСтатусКлиента(ДокументОбъект.Дата, ДокументОбъект.ПредыдущаяОперация.Залогодатель); 
	ДокументОбъект.Залогодатель = ДокументВозврата.Залогодатель;  
	ДокументОбъект.ДокументЗалогодателя = ДокументВозврата.ДокументЗалогодателя;
	ДокументОбъект.СхемаКредитования = ДокументВозврата.СхемаКредитования;  
	ДокументОбъект.СрокЗалога = ДокументВозврата.СрокЗалога; 
	ДокументОбъект.Акция = ЗалоговыйБилет.Акция;
	ДокументОбъект.НомерЗалоговогоБилета = ДокументВозврата.НомерЗалоговогоБилета;
	ДокументОбъект.Ломбард = Ломбард; 
	//ДокументОбъект.Ответственный = ОтветственныйПользователь;
	ДокументОбъект.ОтветственныйПользователь = ОтветственныйПользователь; 
	ДокументОбъект.ОтветственныйСотрудник = ОтветственныйСотрудник; 

	ДокументОбъект.Комментарий = Комментарий;
	ДокументОбъект.ДокументВозвратаНаименование = ДокументВозвратаНаименование;  
	ДокументОбъект.ДокументВозвратаНомер = ДокументВозвратаНомер;
	ДокументОбъект.ДокументВозвратаДата = ДокументВозвратаДата;
	ДокументОбъект.ОтмененныйДокумент = ДокументВозврата;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ДатаДок);
	Запрос.УстановитьПараметр("Залогодатель", ДокументОбъект.Залогодатель);
    Запрос.Текст = "ВЫБРАТЬ
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.ДатаРождения КАК ДатаРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.МестоРождения КАК МестоРождения,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Гражданство КАК Гражданство,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Email КАК Email,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.АдресПоПрописке КАК АдресПоПрописке,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Пол КАК Пол,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Телефон КАК Телефон,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Фамилия КАК Фамилия,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Имя КАК Имя,
                   |	ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних.Отчество КАК Отчество
                   |ИЗ
                   |	РегистрСведений.ЛБ_КонтактнаяИнформацияЗалогодателей.СрезПоследних(&Дата, Залогодатель = &Залогодатель) КАК ЛБ_КонтактнаяИнформацияЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.Фамилия = Выборка.Фамилия;
        ДокументОбъект.Имя = Выборка.Имя;
        ДокументОбъект.Отчество = Выборка.Отчество;		
		ДокументОбъект.ДатаРождения = Выборка.ДатаРождения;		
		ДокументОбъект.Гражданство = Выборка.Гражданство;
		ДокументОбъект.Пол = Выборка.Пол;  
		ДокументОбъект.ВозрастЗалогодателя = ЛБ_ОбщийМодуль.ВычислитьВозраст(ДокументОбъект.ДатаРождения);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументЗалогодателя", ДокументОбъект.ДокументЗалогодателя);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокументаЗалогодателя КАК ВидДокументаЗалогодателя,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ВидДокумента КАК ВидДокумента,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСерия КАК ДокументСерия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНомер КАК ДокументНомер,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументДатаВыдачи КАК ДокументДатаВыдачи,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКемВыдан КАК ДокументКемВыдан,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументКодПодразделения КАК ДокументКодПодразделения,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументНачалоДействия КАК ДокументНачалоДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.ДокументСрокДействия КАК ДокументСрокДействия,
	               |	ЛБ_ДокументыЗалогодателейСрезПоследних.Гражданство КАК Гражданство
	               |ИЗ
	               |	РегистрСведений.ЛБ_ДокументыЗалогодателей.СрезПоследних(&Дата, ДокументЗалогодателя = &ДокументЗалогодателя) КАК ЛБ_ДокументыЗалогодателейСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДокументОбъект.ДокументВидДокументаЗалогодателя = Выборка.ВидДокументаЗалогодателя;
		ДокументОбъект.ДокументВид = Выборка.ВидДокумента;
		ДокументОбъект.ДокументГражданство = Выборка.Гражданство;
		ДокументОбъект.ДокументСерия = Выборка.ДокументСерия;
		ДокументОбъект.ДокументНомер = Выборка.ДокументНомер;
		ДокументОбъект.ДокументДатаВыдачи = Выборка.ДокументДатаВыдачи;
		ДокументОбъект.ДокументКемВыдан = Выборка.ДокументКемВыдан;
		ДокументОбъект.ДокументКодПодразделения = Выборка.ДокументКодПодразделения;
		ДокументОбъект.ДокументНачалоДействия = Выборка.ДокументНачалоДействия;
		ДокументОбъект.ДокументСрокДействия = Выборка.ДокументСрокДействия;
	КонецЕсли;
	
	ДокументОбъект.ТоварыИзъятыеВозвращенные.Очистить();
	Для каждого стр из ТаблицаТоваров Цикл 
		Если НЕ стр.Вернуть Тогда
			Продолжить;
		КонецЕсли;	
		НоваяСтр = ДокументОбъект.ТоварыИзъятыеВозвращенные.Добавить();
		НоваяСтр.ОбъектЗалога = Стр.ОбъектЗалога;  
		НоваяСтр.СуммаОценки = Стр.СуммаОценки;
	Конеццикла;	
	
	Отбор = Новый структура;
	Отбор.Вставить("КлючСтроки", 2);
	Строки = ТаблицаСостояний.НайтиСтроки(Отбор);  
	СтрНач = Строки.Получить(0);
	ДокументОбъект.ДатаВыкупа = СтрНач.ДатаВозврата;
    ДокументОбъект.ДатаВыкупаЛьготная = СтрНач.ДатаВозвратаЛьготная;	
	ДокументОбъект.СуммаСсуды = СтрНач.СуммаЗайма;  
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	Попытка           
	    ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		//+МАН 17.06.25 Убрал
		//ДокументОтмены = ДокументОбъект.Ссылка;

		////Установка отментки об отмене документа в отменяемом документе
		//ОтменяемыйДокумент = ДокументВозврата.ПолучитьОбъект();
		//ОтменяемыйДокумент.ДокументОтмены = ДокументОтмены;

		//ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Запись);
		//
		//Попытка           
		//    ОтменяемыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		//Исключение
		//	ОбщегоНазначения.СообщитьПользователю("Не удалось установить отметку в отменяемом документе");
		//КонецПопытки;
		//
				
		Возврат Истина;
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось провести документ " + строка(ДокументОбъект.Ссылка));
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИнформациюОЗБ(ЗалоговыйБилет, Дата)
	
	Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, Дата,, Истина);
	
	//+Мельников 06.05.24 Сделано на время тестирования. Убрать при запуске ломбардов.
	Если Результат = Неопределено Тогда
		ДатаПроверки = ТекущаяДата() + 94608000; // + три года к дате проверки документа
		Результат = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ДатаПроверки,, Истина);
	КонецЕсли;
	//-Мельников

	ПоследняяОперация = Новый Структура;
	ПоследняяОперация.Вставить("Дата", Результат.Регистратор.Дата);
	ПоследняяОперация.Вставить("ВидОперации", Результат.Регистратор.ВидОперации);
	ПоследняяОперация.Вставить("ДокументОперации", Результат.Регистратор);
	
	Возврат ПоследняяОперация;

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардПольвателя()
	Возврат ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЛомбардВдокументе(Ссылка)
	Возврат Ссылка.Ломбард;
КонецФункции

&НаСервере
Процедура УстановитьВидимость()

	ПроверкаПоследующихОпереаций = ЛБ_ОбщийМодуль.ПолучитьСостояниеЗБ(ЗалоговыйБилет.НомерЗалоговогоБилета, ТекущаяДата(),,Истина);
	ЛомбардПользователя = ЛБ_ОбщийМодуль.ПолучитьЛомбардПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Если ДокументВозврата.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда 
		Если ДокументВозврата.Проведен И НачалоДня(ТекущаяДатаСеанса()) = НачалоДня(ДатаДок) И
			?(ЗначениеЗаполнено(ДокументВозврата), ?(ПроверкаПоследующихОпереаций = Неопределено, Истина, ?(ПроверкаПоследующихОпереаций.Регистратор = Документвозврата, Истина, Ложь)), Ложь) Тогда
			
			Элементы.ОтменитьОперацию.Доступность = Истина;
		Иначе
			Элементы.ОтменитьОперацию.Доступность = Ложь;
		КонецЕсли; 
	Иначе	
		Если ДокументВозврата.Проведен И НЕ ТекущаяДата() - ДатаДок >= 3600 И ЛомбардПользователя = ДокументВозврата.Ломбард И
			?(ЗначениеЗаполнено(ДокументВозврата), ?(ПроверкаПоследующихОпереаций = Неопределено, Истина, ?(ПроверкаПоследующихОпереаций.Регистратор = ДокументВозврата, Истина, Ложь)), Ложь) Тогда
			
			Элементы.ОтменитьОперацию.Доступность = Истина;
		Иначе
			Элементы.ОтменитьОперацию.Доступность = Ложь;
		КонецЕсли;  
	КонецЕсли;	

	//+МАН 17.06.25 изменил
	//Если ЗначениеЗаполнено(ДокументВозврата.ДокументОтмены) Тогда
	Если ЗначениеЗаполнено(ДокументОтмены) Тогда
	//-МАН		
	    Элементы.ГруппаОтмена.Видимость = Истина;
		//+Мельников 28.05.24
		Элементы.Расчеты.Доступность = Ложь;
		Элементы.Редактировать.Доступность = Ложь;
		//-Мельников
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДокументОтменыНажатие(Элемент, СтандартнаяОбработка)
	
	Если ПолучитьВидОперации(ДокументОтмены) = ПредопределенноеЗначение("Перечисление.ЛБ_ВидыОперацийОперацияПоЗалогу.ОтменаВозвратаИзъятого") Тогда 
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", ДокументОтмены);    
		ОткрытьФорму("ОбщаяФорма.ЛБ_ОтменаОперацииПоЗайму", ПараметрыФормы, ЭтаФорма, Истина,,,);	
	Иначе                           
		СтандартнаяОбработка = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидОперации(Ссылка)
    Возврат Ссылка.ВидОперации
КонецФункции

&НаСервере
Функция ПолучитьДокументОтмены(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрСведений.ЛБ_ОтменыОперацийЗБ.СрезПоследних(&Период, ) КАК ЛБ_ОтменыОперацийЗБСрезПоследних
		|ГДЕ
		|	ЛБ_ОтменыОперацийЗБСрезПоследних.ОтмененныйДокумент В(&ЗБ)";
	
	Запрос.УстановитьПараметр("ЗБ", Ссылка);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.Регистратор;
	КонецЕсли;
	
	Возврат Документы.ЛБ_ОперацияПоЗалогу.ПустаяСсылка();
	
КонецФункции
//-Мельников
